{
  "backend/main.mo": "Motoko backend providing authorization, user profile storage, portfolio profile editing, and work item CRUD with ordering and video flags.",
  "feature_evidence.json": "Feature evidence report linking features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing UI components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, theme variables, and dark mode overrides.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering portfolio sections, admin panel for owners, and global theming.",
  "frontend/src/components/admin/AdminPanel.tsx": "Admin interface with tabs for editing profile data and managing work items.",
  "frontend/src/components/admin/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/admin/ProfileEditor.tsx": "Form for editing portfolio profile fields with validation, social link management, and backend sync.",
  "frontend/src/components/admin/WorkItemsEditor.tsx": "Admin UI for listing, adding, deleting, and drag‑and‑drop reordering work items with video detection.",
  "frontend/src/components/portfolio/AboutSection.tsx": "Displays the profile’s bio and social links with animated reveal using intersection observers.",
  "frontend/src/components/portfolio/ContactSection.tsx": "Static contact section showing phone, email, and Instagram link.",
  "frontend/src/components/portfolio/Footer.tsx": "Footer showing attribution and current year with a link to caffeine.ai.",
  "frontend/src/components/portfolio/HeaderContact.tsx": "Compact header contact bar with phone, email, and Instagram links.",
  "frontend/src/components/portfolio/IntroSection.tsx": "Hero intro section with animated text and a button that scrolls to the work section.",
  "frontend/src/components/portfolio/SectionNav.tsx": "Sticky navigation bar tracking active section via IntersectionObserver with mobile menu support.",
  "frontend/src/components/portfolio/WorkSection.tsx": "Fetches and displays work items with animations, fallback skeletons, and empty state messaging.",
  "frontend/src/components/work/VideoEmbed.tsx": "Embeds a responsive iframe video for a detected provider.",
  "frontend/src/components/work/WorkCard.tsx": "Card showing a work item’s title, optional video embed, description, and external link.",
  "frontend/src/components/work/WorkGrid.tsx": "Grid layout that animates and renders a list of WorkCard components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated user is an admin by calling actor.isOwner().",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, managing login, stored identities, and auth client setup.",
  "frontend/src/hooks/useInView.ts": "Provides an IntersectionObserver-based hook to detect when an element enters the viewport.",
  "frontend/src/hooks/useProfile.ts": "Provides hooks to fetch and update the user's profile via the backend actor.",
  "frontend/src/hooks/useWorkItems.ts": "Fetches, merges, and sorts seeded and backend work items, and provides mutations to add, delete, and reorder them.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and theme variables for light and dark modes with global styling.",
  "frontend/src/lib/seedWorkItems.ts": "Contains predefined fallback work items merged with backend data.",
  "frontend/src/lib/videoProviders.ts": "Detects video providers like YouTube or Vimeo from URLs and returns corresponding embed info.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, theme extensions for colors, fonts, radii, and custom keyframes, plus plugin imports for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, issues, and feature requests related to fixing work item loading and embedding YouTube videos in the My Work section."
}